<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"896afcf38c9d52f887d5032b5f78a3a50669a3ec00afbe44a3f7ce18c4038e11","plan_job_ref":"Job Pull Request Checks #4887 at https://github.com/GSA-TTS/FAC/actions/runs/16166899415","plan_out_hash":"81f9dd87e496b31ddf68aef71e7860e7f6d8301ae4d0d3f493b4d3020313e5e7","plan_hash":"6b0cb672f38b49d9f3dcbe5fba3c8d7ef1a4ee9a9128b2254fe820822539b7af","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 7 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:3357cf6e7675895586217b7b5b1954a0e8f4e69541d36d5a5b14a6c325bb1311" -> "ghcr.io/gsa-tts/fac/clamav@sha256:f169029f996b0e4d9704570e96a844db8a6a021f2d694b48b96cede4c445dfee"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-07-02T19:30:59Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-07-02T19:29:36Z" -> (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:3357cf6e7675895586217b7b5b1954a0e8f4e69541d36d5a5b14a6c325bb1311" -> "ghcr.io/gsa-tts/fac/clamav@sha256:f169029f996b0e4d9704570e96a844db8a6a021f2d694b48b96cede4c445dfee"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-production-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-07-02T19:30:20Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-               app_process_type = "web" -> null
-               id               = "68e16414-09a5-4efc-b00a-6ec2344161a2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "5ae55cd7-5641-4974-a489-56a5cf2c7524"
!~      updated_at   = "2025-04-21T20:54:32Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-               app_process_type = "web" -> null
-               id               = "971aa7d7-3aca-418e-aabc-65c90bb0ebe0" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "99f526e3-e8ab-4375-839d-3f1a3907f412"
!~      updated_at   = "2025-06-23T19:12:23Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4887](https://github.com/GSA-TTS/FAC/actions/runs/16166899415)